Autodesk.Revit.DB.LinePattern.SetSegments(System.Collections.Generic.IList{Autodesk.Revit.DB.LinePatternSegment})
Sets the sequence of segments that defines this line pattern.
lineSegs:
The sequence of segments.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.LinePattern.Name
Line pattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.LinePattern.#ctor(System.String)
Creates a line pattern with given name.
name:
The name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null